---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentColor
source: html/ad5100c6-b5e3-bbd9-e4ac-9e0601a89e25.htm
---
# Autodesk.Revit.DB.Visual.AdvancedTransparent.TransparentColor Property

The property labeled "Color" from the "AdvancedTransparent" schema.

## Syntax (C#)
```csharp
public static string TransparentColor { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.